OpenNuvoton/NUC980_NonOS_BSP/Driver/Source/pwm.c
/**************************************************************************//**
 * @file     pwm.c
 * @version  V1.00
 * $Revision: 5 $
 * $Date: 15/06/11 7:32p $
 * @brief    NUC980 series PWM driver source file
 *
 * @note
 * SPDX-License-Identifier: Apache-2.0
 * Copyright (C) 2018 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include "nuc980.h"
#include "sys.h"
#include "pwm.h"
/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup PWM_Driver PWM Driver
  @{
*/


/** @addtogroup PWM_EXPORTED_FUNCTIONS PWM Exported Functions
  @{
*/

//Internal function definition
/// @cond HIDDEN_SYMBOLS

void pwm0ISR(PVOID pvParam);
void pwm1ISR(PVOID pvParam);


static INT pwmInitGPIO(const INT nTimerIdentity, const INT nValue);
static INT pwmInitTimer(const INT nTimerIdentity);
static INT pwmStartTimer(const INT nTimerIdentity);
static INT pwmStopTimer(const INT nTimerIdentity, const INT nMethod);
// Register operation
static INT pwmSetCP(const INT nTimerIdentity, const INT nValue);
static INT pwmSetDZI(const INT nTimerIdentity, const INT nValue);
static INT pwmSetCSR(const INT nTimerIdentity, const INT nValue);
static INT pwmSetDZGenerator(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetTimerState(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetInverter(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetMode(const INT nTimerIdentity, const INT nStatus);
static INT pwmSetCNR(const INT nTimerIdentity, const INT nValue);
static INT pwmSetCMR(const INT nTimerIdentity, const INT nValue);
static UINT pwmGetPDR(const INT nTimerIdentity);
static INT pwmSetPIER(const INT nTimerIdentity, const INT value);
static INT pwmCleanPIIR(const INT nTimerIdentity);

//Global variable
static BOOL bPWM0IRQFlag = FALSE; //IRQ enable flag, set after PWM0 IRQ enable
static BOOL bPWM1IRQFlag = FALSE; //IRQ enable flag, set after PWM1 IRQ enable
static BOOL bPWMTimerOpenStatus[PWM_TIMER_NUM]; //timer flag which set after open(for disable IRQ decision)
static BOOL bPWMTimerStartStatus[PWM_TIMER_NUM]; //timer flag which set after Start count(to avoid incorrectly stop procedure)
static BOOL bPWMTimerMode[PWM_TIMER_NUM]; //PWM timer toggle/one shot mode
static BOOL volatile bPWMIntFlag[PWM_TIMER_NUM]; //interrupt flag which set by ISR
/// @endcond /* HIDDEN_SYMBOLS */


/**
  * @brief The init function of PWM device driver
  */
INT pwmInit(const INT nTimerIdentity)
{
    UINT temp;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel; // nPWMIdentity value error
    }

    // Enable PWM clock
    if(nTimerIdentity <= PWM0_TIMER3)
    {
        temp = inpw(REG_CLK_PCLKEN1);
        temp = temp | 0x4000000;
        outpw(REG_CLK_PCLKEN1, temp);
        sysInstallISR(IRQ_LEVEL_1, IRQ_PWM0, (PVOID)pwm0ISR);
    }
    else  // PWM1
    {
        temp = inpw(REG_CLK_PCLKEN1);
        temp = temp | 0x8000000;
        outpw(REG_CLK_PCLKEN1, temp);
        sysInstallISR(IRQ_LEVEL_1, IRQ_PWM1, (PVOID)pwm1ISR);
    }

    sysSetLocalInterrupt(ENABLE_IRQ);  // Enable CPSR I bit

    return 0;
}

/**
  * @brief The exit function of PWM device driver
  */
INT pwmExit(void)
{
    return 0;
}

/**
  * @brief The open function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @retval Successful PWM successfully opened
  * @retval pwmTimerBusy PWM timer already open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
INT pwmOpen(const INT nTimerIdentity)
{
    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }

    if(bPWMTimerOpenStatus[nTimerIdentity] == TRUE)
    {
        return pwmTimerBusy;
    }

    if((nTimerIdentity < PWM1_TIMER0) && (bPWM0IRQFlag == FALSE))
    {
        sysEnableInterrupt(IRQ_PWM0);

        bPWM0IRQFlag = TRUE;
    }
    else if((nTimerIdentity > PWM0_TIMER3) && (bPWM1IRQFlag == FALSE))
    {
        sysEnableInterrupt(IRQ_PWM1);

        bPWM1IRQFlag = TRUE;
    }

    bPWMTimerOpenStatus[nTimerIdentity] = TRUE;

    // Set PWM timer default value(CSR->PPR->PCR->CMR->CNR)
    pwmInitTimer(nTimerIdentity);

    //Enable PIER
    pwmSetPIER(nTimerIdentity, PWM_ENABLE);

    //Reset PIIR
    pwmCleanPIIR(nTimerIdentity);

    //Reset PWM timer start count flag
    bPWMTimerStartStatus[nTimerIdentity] = FALSE;

    return Successful;

}

/**
  * @brief The close function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @retval Successful PWM successfully closed
  * @retval pwmTimerNotOpen PWM timer not open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
INT pwmClose(const INT nTimerIdentity)
{
    INT nLoop;
    BOOL uAllPWM0TimerClose = TRUE;
    BOOL uAllPWM1TimerClose = TRUE;

    if( nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX )
    {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }

    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE)
    {
        return pwmTimerNotOpen;
    }

    bPWMTimerOpenStatus[nTimerIdentity] = FALSE;

    //Check if all pmw0 timer stop, IRQ can be disable
    for(nLoop = PWM_TIMER_MIN; nLoop < PWM1_TIMER0; nLoop++)
    {
        if(bPWMTimerOpenStatus[nLoop] == TRUE)
        {
            uAllPWM0TimerClose = FALSE;
        }
    }

    //Check if all pmw1 timer stop, IRQ can be disable
    for(nLoop = PWM1_TIMER0; nLoop < PWM_TIMER_NUM; nLoop++)
    {
        if(bPWMTimerOpenStatus[nLoop] == TRUE)
        {
            uAllPWM1TimerClose = FALSE;
        }
    }

    //All timer stop, disable IRQs
    if(uAllPWM0TimerClose == TRUE)
    {
        sysDisableInterrupt(IRQ_PWM0);
        bPWM0IRQFlag = FALSE;
    }

    if(uAllPWM1TimerClose == TRUE)
    {
        sysDisableInterrupt(IRQ_PWM1);
        bPWM1IRQFlag = FALSE;
    }

    pwmSetPIER(nTimerIdentity, PWM_DISABLE);

    pwmCleanPIIR(nTimerIdentity);

    return Successful;

