OpenNuvoton/NUC980_NonOS_BSP/Driver/Source/pwm.c
}

/**
  * @brief The read function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @param[out] pucStatusValue The point of typePWMSTATUS
  * @param[in] uLength The length of typePWMSTATUS
  * @retval Successful Read PWM value successfully
  * @retval pwmTimerNotOpen PWM timer not open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidStructLength Struct length error(struct type error)
  */
INT pwmRead(const INT nTimerIdentity, PUCHAR pucStatusValue, const UINT uLength)
{
    if( nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX )
    {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }

    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE)
    {
        return pwmTimerNotOpen;
    }

    if(uLength != sizeof(typePWMSTATUS))
    {
        return pwmInvalidStructLength;// Struct length error(struct type error)
    }

    if( sizeof(*((typePWMSTATUS *)pucStatusValue)) != sizeof(typePWMSTATUS) )
    {
        return pwmInvalidStructLength;// Struct length error(struct type error)
    }

    ((typePWMSTATUS *)pucStatusValue)->PDR = pwmGetPDR(nTimerIdentity);

    if(bPWMIntFlag[nTimerIdentity] == TRUE)
    {
        bPWMIntFlag[nTimerIdentity] = FALSE;
        ((typePWMSTATUS *)pucStatusValue)->InterruptFlag = TRUE;
    }
    else
    {
        ((typePWMSTATUS *)pucStatusValue)->InterruptFlag = FALSE;
    }

    return Successful;

}

/**
  * @brief The write function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @param[in] pucCNRCMRValue The value of CNR and CMR
  * @param[in] uLength For future usage
  * @retval Successful Write PWM setting successfully
  * @retval pwmTimerNotOpen PWM timer not open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
INT pwmWrite(const INT nTimerIdentity, PUCHAR pucCNRCMRValue, const UINT uLength)
{
    typePWMVALUE pwmvalue;
    INT nStatus;

    if( nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX )
    {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }

    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE)
    {
        return pwmTimerNotOpen;
    }

    if(uLength != sizeof(typePWMVALUE))
    {
        return pwmInvalidStructLength;// Struct length error(struct type error)
    }

    pwmvalue.value = ((typePWMVALUE *)pucCNRCMRValue)->value;
    nStatus = pwmSetCNR(nTimerIdentity, pwmvalue.field.cnr);

    if(nStatus != Successful)
    {
        return nStatus;
    }

    nStatus = pwmSetCMR(nTimerIdentity, pwmvalue.field.cmr);

    if(nStatus != Successful)
    {
        return nStatus;
    }

    return Successful;

}

/**
  * @brief The ioctl function of PWM device driver
  * @param[in] nTimerIdentity PWM Timer channel identity
  * @param[in] uCommand Ioctl command which indicates different operation
  * @param[in] uIndication Not use in PWM
  * @param[in] uValue The value which use with uCommand
  * @retval Successful PWM ioctl execute successfully
  * @retval pwmTimerNotOpen PWM timer not open
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidIoctlCommand Ioctl command error
  * @retval Others Error according to different uCommand
  */
INT pwmIoctl(const INT nTimerIdentity, const UINT uCommand, const UINT uIndication, UINT uValue)
{
    INT nStatus;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }

    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE)
    {
        return pwmTimerNotOpen;
    }

    switch(uCommand)
    {
    case START_PWMTIMER:
    {
        nStatus = pwmStartTimer(nTimerIdentity);
        break;
    }

    case STOP_PWMTIMER:
    {
        // default stop method is 2
        nStatus = pwmStopTimer(nTimerIdentity, PWM_STOP_METHOD2);
        break;
    }

    case SET_CSR:
    {
        nStatus = pwmSetCSR(nTimerIdentity, uValue);
        break;
    }

    case SET_CP:
    {
        nStatus = pwmSetCP(nTimerIdentity, uValue);
        break;
    }

    case SET_DZI:
    {
        nStatus = pwmSetDZI(nTimerIdentity, uValue);
        break;
    }

    case SET_INVERTER:
    {
        nStatus = pwmSetInverter(nTimerIdentity, uValue);
        break;
    }

    case SET_MODE:
    {
        nStatus = pwmSetMode(nTimerIdentity, uValue);
        break;
    }

    case ENABLE_DZ_GENERATOR:
    {
        nStatus = pwmSetDZGenerator(nTimerIdentity, PWM_ENABLE);
        break;
    }

    case DISABLE_DZ_GENERATOR:
    {
        nStatus = pwmSetDZGenerator(nTimerIdentity, PWM_DISABLE);
        break;
    }

    case ENABLE_PWMGPIOOUTPUT:
    {
        nStatus = pwmInitGPIO(nTimerIdentity, uValue);
        break;
    }

    default:
    {
        return pwmInvalidIoctlCommand;
    }
    }

    return nStatus;
}

/// @cond HIDDEN_SYMBOLS

/**
  * @brief The interrupt service routines of PWM0
  * @param[in] pvParam IRQ Parameter(not use in PWM)
  */
VOID pwm0ISR(PVOID pvParam)
{
    INT i;

    UINT32 uRegisterValue = 0;
    uRegisterValue = inpw(REG_PWM0_PIIR);// Get PIIR value

    for(i = 0; i < PWM1_TIMER0 ; i++)
    {
        if(uRegisterValue & (1 << i))
        {
            bPWMIntFlag[i] = 1;
            outpw(REG_PWM0_PIIR, (1 << i));
        }
    }
}

/**
  * @brief The interrupt service routines of PWM1
  * @param[in] pvParam IRQ Parameter(not use in PWM)
  */
VOID pwm1ISR(PVOID pvParam)
{
    INT i;

    UINT32 uRegisterValue = 0;
    uRegisterValue = inpw(REG_PWM1_PIIR);// Get PIIR value

    for(i = PWM1_TIMER0; i < PWM_TIMER_NUM ; i++)
    {
        if(uRegisterValue & (1 << (i-PWM1_TIMER0)))
        {
            bPWMIntFlag[i] = 1;
            outpw(REG_PWM1_PIIR, (1 << (i-PWM1_TIMER0)));
        }
    }
}

/**
  * @brief This function set corresponding GPIO as PWM function according to the
  *        parameter nTimerIdentity
  * @param[in] nTimerIdentity Timer channel number
  * @retval Successful PWM init GPIO successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidPin PWM output pin setting error
  */
static INT pwmInitGPIO(const INT nTimerIdentity, const INT nValue)
{
    UINT temp = 0;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if(nTimerIdentity == PWM0_TIMER0)
    {
        if(nValue == PWM00_GPF5)
        {
            temp = inpw(REG_SYS_GPF_MFPL);
            temp = (temp & ~0x00F00000) | 0x00400000;
            outpw(REG_SYS_GPF_MFPL, temp);
        }
        else if(nValue == PWM00_GPG0)
        {
            temp = inpw(REG_SYS_GPG_MFPL);
            temp = (temp & ~0xF) | 0x6;
            outpw(REG_SYS_GPG_MFPL, temp);
        }
        else if(nValue == PWM00_GPD12)
        {
            temp = inpw(REG_SYS_GPD_MFPH);
            temp = (temp & ~0x000F0000) | 0x60000;
            outpw(REG_SYS_GPD_MFPH, temp);
        }
        else if(nValue == PWM00_GPG10)
        {
            temp = inpw(REG_SYS_GPG_MFPH);
            temp = (temp & ~0x00000F00) | 0x700;
            outpw(REG_SYS_GPG_MFPH, temp);
        }
        else
            return pwmInvalidPin;
    }
    else if(nTimerIdentity == PWM0_TIMER1)
    {
        if(nValue == PWM01_GPF6)
        {
            temp = inpw(REG_SYS_GPF_MFPL);
            temp = (temp & ~0x0F000000) | 0x04000000;
            outpw(REG_SYS_GPF_MFPL, temp);
        }
        else if(nValue == PWM01_GPG1)
        {
            temp = inpw(REG_SYS_GPG_MFPL);
            temp = (temp & ~0xF0) | 0x60;
            outpw(REG_SYS_GPG_MFPL, temp);
        }
        else if(nValue == PWM01_GPD13)
        {
            temp = inpw(REG_SYS_GPD_MFPH);
            temp = (temp & ~0x00F00000) | 0x600000;
            outpw(REG_SYS_GPD_MFPH, temp);
        }
        else if(nValue == PWM01_GPA15)
        {
            temp = inpw(REG_SYS_GPA_MFPH);
            temp = (temp & ~0xF0000000) | 0x70000000;
            outpw(REG_SYS_GPA_MFPH, temp);
        }
        else
            return pwmInvalidPin;
    }
    else if(nTimerIdentity == PWM0_TIMER2)
    {
        if(nValue == PWM02_GPF7)
        {
            temp = inpw(REG_SYS_GPF_MFPL);
            temp = (temp & ~0xF0000000) | 0x40000000;
            outpw(REG_SYS_GPF_MFPL, temp);
        }
        else if(nValue == PWM02_GPG2)
        {
            temp = inpw(REG_SYS_GPG_MFPL);
            temp = (temp & ~0xF00) | 0x600;
            outpw(REG_SYS_GPG_MFPL, temp);
        }
        else if(nValue == PWM02_GPD14)
        {
            temp = inpw(REG_SYS_GPD_MFPH);
            temp = (temp & ~0x0F000000) | 0x6000000;
            outpw(REG_SYS_GPD_MFPH, temp);
        }
        else if(nValue == PWM02_GPA14)
        {
            temp = inpw(REG_SYS_GPA_MFPH);
            temp = (temp & ~0x0F000000) | 0x07000000;
            outpw(REG_SYS_GPA_MFPH, temp);
        }
        else if(nValue == PWM02_GPB13)
        {
            temp = inpw(REG_SYS_GPB_MFPH);
            temp = (temp & ~0x00F00000) | 0x0040000;
            outpw(REG_SYS_GPB_MFPH, temp);
        }
        else
            return pwmInvalidPin;
    }
    else if(nTimerIdentity == PWM0_TIMER3)
    {
        if(nValue == PWM03_GPF8)
        {
            temp = inpw(REG_SYS_GPF_MFPH);
            temp = (temp & ~0xF) | 0x4;
            outpw(REG_SYS_GPF_MFPH, temp);
        }
        else if(nValue == PWM03_GPG3)
        {
            temp = inpw(REG_SYS_GPG_MFPL);
            temp = (temp & ~0xF000) | 0x6000;
            outpw(REG_SYS_GPG_MFPL, temp);
        }
        else if(nValue == PWM03_GPD15)
        {
            temp = inpw(REG_SYS_GPD_MFPH);
            temp = (temp & ~0xF0000000) | 0x60000000;
            outpw(REG_SYS_GPD_MFPH, temp);
        }
        else if(nValue == PWM03_GPA13)
        {
            temp = inpw(REG_SYS_GPA_MFPH);
            temp = (temp & ~0x00F00000) | 0x00700000;
            outpw(REG_SYS_GPA_MFPH, temp);
        }
        else
            return pwmInvalidPin;
    }
    else if(nTimerIdentity == PWM1_TIMER0)
    {
        if(nValue == PWM10_GPB12)
        {
            temp = inpw(REG_SYS_GPB_MFPH);
            temp = (temp & ~0x000F0000) | 0x00020000;
            outpw(REG_SYS_GPB_MFPH, temp);
        }
        else if(nValue == PWM10_GPG6)
        {
            temp = inpw(REG_SYS_GPG_MFPL);
            temp = (temp & ~0x0F000000) | 0x06000000;
            outpw(REG_SYS_GPG_MFPL, temp);
        }
        else if(nValue == PWM10_GPG11)
        {
            temp = inpw(REG_SYS_GPG_MFPH);
            temp = (temp & ~0x0000F000) | 0x00006000;
            outpw(REG_SYS_GPG_MFPH, temp);
        }
        else if(nValue == PWM10_GPF9)
        {
            temp = inpw(REG_SYS_GPF_MFPH);
            temp = (temp & ~0x000000F0) | 0x000000040;
            outpw(REG_SYS_GPF_MFPH, temp);
        }
        else
            return pwmInvalidPin;
    }
    else if(nTimerIdentity == PWM1_TIMER1)
    {
        if(nValue == PWM11_GPB11)
        {
            temp = inpw(REG_SYS_GPB_MFPH);
            temp = (temp & ~0x0000F000) | 0x00002000;
            outpw(REG_SYS_GPB_MFPH, temp);
        }
        else if(nValue == PWM11_GPG7)
        {
            temp = inpw(REG_SYS_GPG_MFPL);
            temp = (temp & ~0xF0000000) | 0x60000000;
            outpw(REG_SYS_GPG_MFPL, temp);
        }
        else if(nValue == PWM11_GPG12)
        {
            temp = inpw(REG_SYS_GPG_MFPH);
            temp = (temp & ~0x000F0000) | 0x00060000;
            outpw(REG_SYS_GPG_MFPH, temp);
        }
        else if(nValue == PWM11_GPF10)
        {
            temp = inpw(REG_SYS_GPF_MFPH);
            temp = (temp & ~0x00000F00) | 0x000000400;
            outpw(REG_SYS_GPF_MFPH, temp);
        }
        else
            return pwmInvalidPin;
    }
    else if(nTimerIdentity == PWM1_TIMER2)
    {
        if(nValue == PWM12_GPB10)
        {
            temp = inpw(REG_SYS_GPB_MFPH);
            temp = (temp & ~0x00000F00) | 0x00000200;
            outpw(REG_SYS_GPB_MFPH, temp);
        }
        else if(nValue == PWM12_GPG8)
        {
            temp = inpw(REG_SYS_GPG_MFPH);
            temp = (temp & ~0xF) | 0x6;
            outpw(REG_SYS_GPG_MFPL, temp);
        }
        else if(nValue == PWM12_GPG13)
        {
            temp = inpw(REG_SYS_GPG_MFPH);
            temp = (temp & ~0x00F00000) | 0x00600000;
            outpw(REG_SYS_GPG_MFPH, temp);
        }
        else if(nValue == PWM12_GPE10)
        {
            temp = inpw(REG_SYS_GPE_MFPH);
            temp = (temp & ~0x00000F00) | 0x000000400;
            outpw(REG_SYS_GPE_MFPH, temp);
        }
        else
            return pwmInvalidPin;
    }
    else if(nTimerIdentity == PWM1_TIMER3)
    {
        if(nValue == PWM13_GPB9)
        {
            temp = inpw(REG_SYS_GPB_MFPH);
            temp = (temp & ~0x000000F0) | 0x00000020;
            outpw(REG_SYS_GPB_MFPH, temp);
        }
        else if(nValue == PWM13_GPG9)
        {
            temp = inpw(REG_SYS_GPG_MFPH);
            temp = (temp & ~0xF0) | 0x60;
            outpw(REG_SYS_GPG_MFPL, temp);
        }
        else if(nValue == PWM13_GPG14)
        {
            temp = inpw(REG_SYS_GPG_MFPH);
            temp = (temp & ~0x0F000000) | 0x06000000;
            outpw(REG_SYS_GPG_MFPH, temp);
        }
        else if(nValue == PWM13_GPE12)
        {
            temp = inpw(REG_SYS_GPE_MFPH);
            temp = (temp & ~0x000F0000) | 0x00040000;
            outpw(REG_SYS_GPE_MFPH, temp);
        }
        else
            return pwmInvalidPin;
    }

    return Successful;
}


/**
  * @brief This function initiates PWM timer n and set the default setting to CSR,
  *        PPR, PCR, CNR, CMR
  * @param[in] nTimerIdentity Timer channel number
  * @retval Successful PWM init timer successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmInitTimer(const INT nTimerIdentity)
{
    typePPR PWMPPR;
    INT nStatus;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }

    //Set CSR
    nStatus = pwmSetCSR(nTimerIdentity, DEFAULT_CSR);

    if(nStatus != Successful)
    {
        return nStatus;
    }

