OpenNuvoton/NUC980_NonOS_BSP/Driver/Source/pwm.c
    //Set PPR
    if(nTimerIdentity < PWM1_TIMER0)
    {
        PWMPPR.value = (UINT)inpw(REG_PWM0_PPR);
    }
    else
    {
        PWMPPR.value = (UINT)inpw(REG_PWM1_PPR);
    }

    switch(nTimerIdentity)
    {
    case PWM0_TIMER0:
    {
        if(PWMPPR.field.cp0 == 0)
        {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }

        break;
    }

    case PWM0_TIMER1:
    {
        if(PWMPPR.field.cp0 == 0)
        {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }

        break;
    }

    case PWM0_TIMER2:
    {
        if(PWMPPR.field.cp1 == 0)
        {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }

        break;
    }

    case PWM0_TIMER3:
    {
        if(PWMPPR.field.cp1 == 0)
        {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }

        break;
    }

    case PWM1_TIMER0:
    {
        if(PWMPPR.field.cp0 == 0)
        {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }

        break;
    }

    case PWM1_TIMER1:
    {
        if(PWMPPR.field.cp0 == 0)
        {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }

        break;
    }

    case PWM1_TIMER2:
    {
        if(PWMPPR.field.cp1 == 0)
        {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }

        break;
    }

    case PWM1_TIMER3:
    {
        if(PWMPPR.field.cp1 == 0)
        {
            pwmSetCP(nTimerIdentity, DEFAULT_CP);
        }

        break;
    }
    }

    //Set PCR
    nStatus = pwmSetMode(nTimerIdentity, DEFAULT_MODE);

    if(nStatus != Successful)
    {
        return nStatus;
    }

    bPWMTimerMode[nTimerIdentity] = DEFAULT_MODE;

    //Set CMR
    nStatus = pwmSetCMR(nTimerIdentity, DEFAULT_CMR);

    if(nStatus != Successful)
    {
        return nStatus;
    }

    //Set CNR
    nStatus = pwmSetCNR(nTimerIdentity, DEFAULT_CNR);

    if(nStatus != Successful)
    {
        return nStatus;
    }

    return Successful;

}


/**
  * @brief This function starts PWM timer according to the parameter
  * @param[in] nTimerIdentity Timer channel number
  * @retval Successful PWM start timer successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmStartTimer(const INT nTimerIdentity)
{
    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    pwmSetTimerState(nTimerIdentity, PWM_ENABLE);

    if(bPWMTimerMode[nTimerIdentity] == PWM_TOGGLE)
    {
        bPWMTimerStartStatus[nTimerIdentity] = TRUE;
    }

    return Successful;
}

/**
  * @brief This function stops PWM timer n using method 1, 2, or 3 according to the
  *        parameter nTimerIdentity and nStatus
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nMethod Stop PWM timer method
  * @retval Successful PWM stop timer successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidStopMethod Stop method error
  */
static INT pwmStopTimer(const INT nTimerIdentity, INT nMethod)
{
    typeCNR PWMCNR;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        // Timer_num value error
        return pwmInvalidTimerChannel;
    }

    //Can't stop before open PWM timer
    if(bPWMTimerOpenStatus[nTimerIdentity] == FALSE)
    {
        return Successful;
    }

    // one shot mode didn't need stop procedure
    if(bPWMTimerMode[nTimerIdentity] == PWM_ONESHOT)
    {
        return Successful;
    }

    // Timer stop already, no need to stop again
    if(bPWMTimerStartStatus[nTimerIdentity] == FALSE)
    {
        return Successful;
    }

    // Set CNR as 0
    PWMCNR.field.cnr = 0;

    if(nTimerIdentity < PWM1_TIMER0)
    {
        outpw(REG_PWM0_CNR0 + (PWM_OFFSET * nTimerIdentity), PWMCNR.value);
    }
    else
    {
        outpw(REG_PWM1_CNR0 + (PWM_OFFSET * (nTimerIdentity - PWM1_TIMER0)), PWMCNR.value);
    }

    switch(nMethod)
    {
    case PWM_STOP_METHOD1:
    {
        while(1)
        {
            if(pwmGetPDR(nTimerIdentity) == 0)   // Wait PDR reach to 0
            {
                pwmSetTimerState(nTimerIdentity, PWM_DISABLE);// Disable pwm timer
                bPWMIntFlag[nTimerIdentity] = FALSE;
                bPWMTimerStartStatus[nTimerIdentity] = FALSE;
                break;
            }
        }

        break;
    }

    case PWM_STOP_METHOD2:
    {
        while(1)
        {
            if(bPWMIntFlag[nTimerIdentity] == TRUE)   // Wait interrupt happen
            {
                pwmSetTimerState(nTimerIdentity, PWM_DISABLE);// Disable pwm timer
                bPWMIntFlag[nTimerIdentity] = FALSE;
                bPWMTimerStartStatus[nTimerIdentity] = FALSE;
                break;
            }
        }

        break;
    }

    /*case PWM_STOP_METHOD3:
    {
        pwmSetPCRState(nTimerIdentity, PWM_DISABLE);// Disable pwm timer
        bPWMIntFlag[nTimerIdentity] = FALSE;
        bPWMTimerStartStatus[nTimerIdentity] = FALSE;
        break;
    }*/
    default:
    {
        return pwmInvalidStopMethod;// Stop method value error
    }
    }

    return Successful;
}

/**
  * @brief This function set CPn value according to the parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue The value which want to set in CSRn
  * @retval Successful Set CPn successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidCPValue PWM_PPR CPn value out of range
  */
static INT pwmSetCP(const INT nTimerIdentity, const INT nValue)
{
    typePPR PWMPPR;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if(nValue < CP_MIN || nValue > CP_MAX)
    {
        return pwmInvalidCPValue;// CP value error
    }

    if (nTimerIdentity < PWM1_TIMER0)
    {
        PWMPPR.value = (UINT)inpw(REG_PWM0_PPR);

        switch(nTimerIdentity)
        {
        case PWM0_TIMER0:
        {
            PWMPPR.field.cp0 = nValue;
            break;
        }

        case PWM0_TIMER1:
        {
            PWMPPR.field.cp0 = nValue;
            break;
        }

