OpenNuvoton/NUC980_NonOS_BSP/Driver/Source/pwm.c
        case PWM0_TIMER2:
        {
            PWMPPR.field.cp1 = nValue;
            break;
        }

        case PWM0_TIMER3:
        {
            PWMPPR.field.cp1 = nValue;
            break;
        }
        }

        outpw(REG_PWM0_PPR, PWMPPR.value);
    }
    else
    {
        PWMPPR.value = (UINT)inpw(REG_PWM1_PPR);

        switch(nTimerIdentity)
        {
        case PWM1_TIMER0:
        {
            PWMPPR.field.cp0 = nValue;
            break;
        }

        case PWM1_TIMER1:
        {
            PWMPPR.field.cp0 = nValue;
            break;
        }

        case PWM1_TIMER2:
        {
            PWMPPR.field.cp1 = nValue;
            break;
        }

        case PWM1_TIMER3:
        {
            PWMPPR.field.cp1 = nValue;
            break;
        }
        }

        outpw(REG_PWM1_PPR, PWMPPR.value);
    }

    return Successful;
}

/**
  * @brief This function set DZIn value according to the parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue The value which want to set in DZIn
  * @retval Successful Set DZIn successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidDZIValue PWM_PPR DZIn value out of range
  */
static INT pwmSetDZI(const INT nTimerIdentity, const INT nValue)
{
    typePPR PWMPPR;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if(nValue < DZI_MIN || nValue > DZI_MAX)
    {
        return pwmInvalidDZIValue;// CSR value error
    }

    if (nTimerIdentity < PWM0_TIMER0)
    {
        PWMPPR.value = (UINT)inpw(REG_PWM0_PPR);

        switch(nTimerIdentity)
        {
        case PWM0_TIMER0:
        {
            PWMPPR.field.dzi0 = nValue;
            break;
        }

        case PWM0_TIMER1:
        {
            PWMPPR.field.dzi0 = nValue;
            break;
        }

        case PWM0_TIMER2:
        {
            PWMPPR.field.dzi1 = nValue;
            break;
        }

        case PWM0_TIMER3:
        {
            PWMPPR.field.dzi1 = nValue;
            break;
        }
        }

        outpw(REG_PWM0_PPR, PWMPPR.value);
    }
    else
    {
        PWMPPR.value = (UINT)inpw(REG_PWM1_PPR);

        switch(nTimerIdentity)
        {
        case PWM1_TIMER0:
        {
            PWMPPR.field.dzi0 = nValue;
            break;
        }

        case PWM1_TIMER1:
        {
            PWMPPR.field.dzi0 = nValue;
            break;
        }

        case PWM1_TIMER2:
        {
            PWMPPR.field.dzi1 = nValue;
            break;
        }

        case PWM1_TIMER3:
        {
            PWMPPR.field.dzi1 = nValue;
            break;
        }
        }

        outpw(REG_PWM1_PPR, PWMPPR.value);
    }

    return Successful;
}

/**
  * @brief This function set CSRn value according to the parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue The value which want to set in CSRn
  * @retval Successful Set CSRn successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmSetCSR(const INT nTimerIdentity, const INT nValue)
{
    typeCSR PWMCSR;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if(nValue < CSR_MIN || nValue > CSR_MAX)
    {
        return pwmInvalidCSRValue;// CSR value error
    }

    if(nTimerIdentity < PWM1_TIMER0)
    {
        PWMCSR.value = (UINT)inpw(REG_PWM0_CSR);

        switch(nTimerIdentity)
        {
        case PWM0_TIMER0:
        {
            PWMCSR.field.csr0 = nValue;
            break;
        }

        case PWM0_TIMER1:
        {
            PWMCSR.field.csr1 = nValue;
            break;
        }

        case PWM0_TIMER2:
        {
            PWMCSR.field.csr2 = nValue;
            break;
        }

        case PWM0_TIMER3:
        {
            PWMCSR.field.csr3 = nValue;
            break;
        }
        }

        outpw(REG_PWM0_CSR, PWMCSR.value);
    }
    else
    {
        PWMCSR.value = (UINT)inpw(REG_PWM1_CSR);

        switch(nTimerIdentity)
        {
        case PWM1_TIMER0:
        {
            PWMCSR.field.csr0 = nValue;
            break;
        }

        case PWM1_TIMER1:
        {
            PWMCSR.field.csr1 = nValue;
            break;
        }

        case PWM1_TIMER2:
        {
            PWMCSR.field.csr2 = nValue;
            break;
        }

        case PWM1_TIMER3:
        {
            PWMCSR.field.csr3 = nValue;
            break;
        }
        }

        outpw(REG_PWM1_CSR, PWMCSR.value);
    }

    return Successful;
}

/**
  * @brief This function enable/disable PWM channel n dead zone function according to the
  *        parameter nTimerIdentity and nStatus
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nStatus PWMDZG_ENABLE/PWMDZG_DISABLE
  * @retval Successful Set dead zone successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidDZGStatus PWM Dead-Zone Generator enable/disable status error
  */
static INT pwmSetDZGenerator(const INT nTimerIdentity, INT nStatus)
{
    typePCR PWMPCR;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if(nStatus != PWMDZG_ENABLE && nStatus != PWMDZG_DISABLE)
    {
        return pwmInvalidDZGStatus;// PCR inverter value error
    }

    if (nTimerIdentity < PWM1_TIMER0)
    {
        PWMPCR.value = (UINT)inpw(REG_PWM0_PCR);

        switch(nTimerIdentity)
        {
        case PWM0_TIMER0:
        {
            PWMPCR.field.grpup0_dzen = nStatus;
            break;
        }

        case PWM0_TIMER1:
        {
            PWMPCR.field.grpup0_dzen = nStatus;
            break;
        }

        case PWM0_TIMER2:
        {
            PWMPCR.field.grpup1_dzen = nStatus;
            break;
        }

        case PWM0_TIMER3:
        {
            PWMPCR.field.grpup1_dzen = nStatus;
            break;
        }
        }

