OpenNuvoton/NUC980_NonOS_BSP/Driver/Source/pwm.c
        outpw(REG_PWM0_PCR, PWMPCR.value);
    }
    else
    {
        PWMPCR.value = (UINT)inpw(REG_PWM1_PCR);

        switch(nTimerIdentity)
        {
        case PWM1_TIMER0:
        {
            PWMPCR.field.grpup0_dzen = nStatus;
            break;
        }

        case PWM1_TIMER1:
        {
            PWMPCR.field.grpup0_dzen = nStatus;
            break;
        }

        case PWM1_TIMER2:
        {
            PWMPCR.field.grpup1_dzen = nStatus;
            break;
        }

        case PWM1_TIMER3:
        {
            PWMPCR.field.grpup1_dzen = nStatus;
            break;
        }
        }

        outpw(REG_PWM1_PCR, PWMPCR.value);
    }

    return Successful;
}

/**
  * @brief This function set PWM channel n enable/disable according to the
  *        parameter nTimerIdentity and nStatus
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nStatus PWM_ENABLE/PWMDISABLE
  * @retval Successful Set channel enable/disable successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmSetTimerState(const INT nTimerIdentity, INT nStatus)
{
    typePCR PWMPCR;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if(nStatus != PWM_ENABLE && nStatus != PWM_DISABLE)
    {
        return pwmInvalidTimerStatus;
    }

    if (nTimerIdentity < PWM1_TIMER0)
    {
        PWMPCR.value = (UINT)inpw(REG_PWM0_PCR);

        switch(nTimerIdentity)
        {
        case PWM0_TIMER0:
        {
            PWMPCR.field.ch0_en = nStatus;
            break;
        }

        case PWM0_TIMER1:
        {
            PWMPCR.field.ch1_en = nStatus;
            break;
        }

        case PWM0_TIMER2:
        {
            PWMPCR.field.ch2_en = nStatus;
            break;
        }

        case PWM0_TIMER3:
        {
            PWMPCR.field.ch3_en = nStatus;
            break;
        }
        }

        outpw(REG_PWM0_PCR, PWMPCR.value);
    }
    else
    {
        PWMPCR.value = (UINT)inpw(REG_PWM1_PCR);

        switch(nTimerIdentity)
        {
        case PWM1_TIMER0:
        {
            PWMPCR.field.ch0_en = nStatus;
            break;
        }

        case PWM1_TIMER1:
        {
            PWMPCR.field.ch1_en = nStatus;
            break;
        }

        case PWM1_TIMER2:
        {
            PWMPCR.field.ch2_en = nStatus;
            break;
        }

        case PWM1_TIMER3:
        {
            PWMPCR.field.ch3_en = nStatus;
            break;
        }
        }

        outpw(REG_PWM1_PCR, PWMPCR.value);
    }

    return Successful;
}


/**
  * @brief This function set PWM channel n inverter on/off according to the
  *        parameter nTimerIdentity and nStatus
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nStatus PWM_ENABLE/PWM_DISABLE
  * @retval Successful Set inverter successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidInverterValue Inverter value error
  */
static INT pwmSetInverter(const INT nTimerIdentity, INT nStatus)
{
    typePCR PWMPCR;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if(nStatus != PWM_INVON && nStatus != PWM_INVOFF)
    {
        return pwmInvalidInverterValue;// PCR inverter value error
    }

    if (nTimerIdentity < PWM1_TIMER0)
    {
        PWMPCR.value = (UINT)inpw(REG_PWM0_PCR);

        switch(nTimerIdentity)
        {
        case PWM0_TIMER0:
        {
            PWMPCR.field.ch0_inverter = nStatus;
            break;
        }

        case PWM0_TIMER1:
        {
            PWMPCR.field.ch1_inverter = nStatus;
            break;
        }

        case PWM0_TIMER2:
        {
            PWMPCR.field.ch2_inverter = nStatus;
            break;
        }

        case PWM0_TIMER3:
        {
            PWMPCR.field.ch3_inverter = nStatus;
            break;
        }
        }

        outpw(REG_PWM0_PCR, PWMPCR.value);
    }
    else
    {
        PWMPCR.value = (UINT)inpw(REG_PWM1_PCR);

        switch(nTimerIdentity)
        {
        case PWM1_TIMER0:
        {
            PWMPCR.field.ch0_inverter = nStatus;
            break;
        }

        case PWM1_TIMER1:
        {
            PWMPCR.field.ch1_inverter = nStatus;
            break;
        }

        case PWM1_TIMER2:
        {
            PWMPCR.field.ch2_inverter = nStatus;
            break;
        }

        case PWM1_TIMER3:
        {
            PWMPCR.field.ch3_inverter = nStatus;
            break;
        }
        }

        outpw(REG_PWM1_PCR, PWMPCR.value);
    }

    return Successful;
}

/**
  * @brief This function set PWM channel n toggle/one shot mode according to the
  *        parameter nTimerIdentity and nStatus
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nStatus PWM_TOGGLE/PWM_ONESHOT
  * @retval Successful Set operation mode successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidModeStatus Operating mode error
  */
static INT pwmSetMode(const INT nTimerIdentity, INT nStatus)
{
    typePCR PWMPCR;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if(nStatus != PWM_TOGGLE && nStatus != PWM_ONESHOT)
    {
        return pwmInvalidModeStatus;// PCR inverter value error
    }

    if (nTimerIdentity < PWM1_TIMER0)
    {
        PWMPCR.value = (UINT)inpw(REG_PWM0_PCR);

        switch(nTimerIdentity)
        {
        case PWM0_TIMER0:
        {
            PWMPCR.field.ch0_mode = nStatus;
            break;
        }

        case PWM0_TIMER1:
        {
            PWMPCR.field.ch1_mode = nStatus;
            break;
        }

        case PWM0_TIMER2:
        {
            PWMPCR.field.ch2_mode = nStatus;
            break;
        }

        case PWM0_TIMER3:
        {
            PWMPCR.field.ch3_mode = nStatus;
            break;
        }
        }

