OpenNuvoton/NUC980_NonOS_BSP/Driver/Source/pwm.c
        outpw(REG_PWM0_PCR, PWMPCR.value);
    }
    else
    {
        PWMPCR.value = (UINT)inpw(REG_PWM1_PCR);

        switch(nTimerIdentity)
        {
        case PWM1_TIMER0:
        {
            PWMPCR.field.ch0_mode = nStatus;
            break;
        }

        case PWM1_TIMER1:
        {
            PWMPCR.field.ch1_mode = nStatus;
            break;
        }

        case PWM1_TIMER2:
        {
            PWMPCR.field.ch2_mode = nStatus;
            break;
        }

        case PWM1_TIMER3:
        {
            PWMPCR.field.ch3_mode = nStatus;
            break;
        }
        }

        outpw(REG_PWM1_PCR, PWMPCR.value);
    }

    bPWMTimerMode[nTimerIdentity] = nStatus;

    return Successful;
}


/**
  * @brief This function set PWM_CNRn value according to the parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue CNR value
  * @retval Successful Set CNR successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidCNRValue Invalid CNR value
  */
static INT pwmSetCNR(const INT nTimerIdentity, INT nValue)
{
    typeCNR PWMCNR;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if(nValue < CNR_MIN || nValue > CNR_MAX)
    {
        return pwmInvalidCNRValue;// PCR inverter value error
    }

    PWMCNR.field.cnr = nValue;

    if (nTimerIdentity < PWM1_TIMER0)
        outpw(REG_PWM0_CNR0 + (PWM_OFFSET * nTimerIdentity), PWMCNR.value);
    else
        outpw(REG_PWM1_CNR0 + (PWM_OFFSET * (nTimerIdentity - PWM1_TIMER0)), PWMCNR.value);

    return Successful;
}

/**
  * @brief This function set PWM_CMRn value according to the parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue CMR value
  * @retval Successful Set CMR successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval pwmInvalidCMRValue Invalid CMR value
  */
static INT pwmSetCMR(const INT nTimerIdentity, INT nValue)
{
    typeCMR PWMCMR;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if(nValue < CMR_MIN || nValue > CMR_MAX)
    {
        return pwmInvalidCMRValue;// CMR value error
    }

    PWMCMR.field.cmr = nValue;

    if (nTimerIdentity < PWM1_TIMER0)
        outpw(REG_PWM0_CMR0 + (PWM_OFFSET * nTimerIdentity), PWMCMR.value);
    else
        outpw(REG_PWM1_CMR0 + (PWM_OFFSET * (nTimerIdentity - PWM1_TIMER0)), PWMCMR.value);

    return Successful;
}

/**
  * @brief This function return the PDR value of PWM timer n
  * @param[in] nTimerIdentity Timer channel number
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  * @retval Others Current PDR value
  */
static UINT pwmGetPDR(const INT nTimerIdentity)
{
    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }
    else
    {
        if (nTimerIdentity < PWM1_TIMER0)
            return (UINT)inpw(REG_PWM0_PDR0 + (PWM_OFFSET * nTimerIdentity)); // Return PDR value
        else
            return (UINT)inpw(REG_PWM1_PDR0 + (PWM_OFFSET * (nTimerIdentity - PWM1_TIMER0))); // Return PDR value
    }
}

/**
  * @brief This function set the PIERn bit of PWM timer n as 1 or 0 according to the
  *        parameter nTimerIdentity and nValue
  * @param[in] nTimerIdentity Timer channel number
  * @param[in] nValue PWM_ENABLE/PWM_DISABLE
  * @retval Successful Set PIER successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmSetPIER(const INT nTimerIdentity, INT nValue)
{
    UINT uRegisterValue = 0;;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// Timer_num value error
    }

    if (nTimerIdentity < PWM1_TIMER0)
    {
        uRegisterValue = (UINT)inpw(REG_PWM0_PIER);

        if(nValue == PWM_ENABLE)
        {
            uRegisterValue = uRegisterValue | (1 << nTimerIdentity); // Set PIER
        }
        else
        {
            uRegisterValue = uRegisterValue & (0 << nTimerIdentity); // Clear PIER
        }

        outpw(REG_PWM0_PIER, uRegisterValue);// Write value to PIER
    }
    else
    {
        uRegisterValue = (UINT)inpw(REG_PWM1_PIER);

        if(nValue == PWM_ENABLE)
        {
            uRegisterValue = uRegisterValue | (1 << (nTimerIdentity - PWM1_TIMER0)); // Set PIER
        }
        else
        {
            uRegisterValue = uRegisterValue & (0 << (nTimerIdentity - PWM1_TIMER0)); // Clear PIER
        }

        outpw(REG_PWM1_PIER, uRegisterValue);// Write value to PIER
    }

    return Successful;
}


/**
  * @brief This function clear PIIRn bit according to the parameter nTimerIdentity
  * @param[in] nTimerIdentity Timer channel number
  * @retval Successful Clear PIIR successfully
  * @retval pwmInvalidTimerChannel PWM Timer channel number error
  */
static INT pwmCleanPIIR(const INT nTimerIdentity)
{
    UINT uRegisterValue = 0;

    if(nTimerIdentity < PWM_TIMER_MIN || nTimerIdentity > PWM_TIMER_MAX)
    {
        return pwmInvalidTimerChannel;// nTimerIdentity value error
    }

    if (nTimerIdentity < PWM1_TIMER0)
    {
        uRegisterValue = (UINT)inpw(REG_PWM0_PIIR);
        uRegisterValue = uRegisterValue & ~(1 << nTimerIdentity);
        outpw(REG_PWM0_PIIR, uRegisterValue);
    }
    else
    {
        uRegisterValue = (UINT)inpw(REG_PWM1_PIIR);
        uRegisterValue = uRegisterValue & ~(1 << (nTimerIdentity - PWM1_TIMER0));
        outpw(REG_PWM1_PIIR, uRegisterValue);
    }

    return Successful;
}

/// @endcond /* HIDDEN_SYMBOLS */

/*@}*/ /* end of group PWM_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group PWM_Driver */

/*@}*/ /* end of group Standard_Driver */

/*** (C) COPYRIGHT 2018 Nuvoton Technology Corp. ***/
